<!-- placeholder-1 -->
```fish
terraform plan -chdir=./ -var-file=./vars.tfvars
```
<!-- placeholder-2 -->

<details><summary>Diff of 17 changes.</summary>

```diff
~ module.kube-hetzner.data.cloudinit_config.autoscaler_config[0] will be read during apply
# (depends on a resource or a module with changes pending)
+ module.kube-hetzner.hcloud_ssh_key.k3s[0] will be created
+ module.kube-hetzner.local_file.kustomization_backup[0] will be created
+ module.kube-hetzner.null_resource.authentication_config["0-0-control-plane-hel1"] will be created
+ module.kube-hetzner.null_resource.configure_autoscaler[0] will be created
+ module.kube-hetzner.null_resource.control_plane_config["0-0-control-plane-hel1"] will be created
+ module.kube-hetzner.null_resource.control_planes["0-0-control-plane-hel1"] will be created
+ module.kube-hetzner.null_resource.first_control_plane will be created
+ module.kube-hetzner.null_resource.kustomization will be created
+ module.kube-hetzner.ssh_sensitive_resource.kubeconfig will be created
~ module.kube-hetzner.module.control_planes["0-0-control-plane-hel1"].data.cloudinit_config.config will be read during apply
# (config refers to values not yet known)
+ module.kube-hetzner.module.control_planes["0-0-control-plane-hel1"].hcloud_server.server will be created
+ module.kube-hetzner.module.control_planes["0-0-control-plane-hel1"].null_resource.os_upgrade_toggle will be created
+ module.kube-hetzner.module.control_planes["0-0-control-plane-hel1"].null_resource.registries will be created
+ module.kube-hetzner.module.control_planes["0-0-control-plane-hel1"].null_resource.zram will be created
+ module.kube-hetzner.module.control_planes["0-0-control-plane-hel1"].random_string.identity_file will be created
+ module.kube-hetzner.module.control_planes["0-0-control-plane-hel1"].random_string.server will be created
```
</details>
<!-- placeholder-3 -->
<details><summary>Plan: 15 to add, 0 to change, 0 to destroy.</br>

<!-- placeholder-4 -->
###### By @tonitert at 2025-08-02T17:20:19Z [(view log)](https://github.com/tonitert/ad-infra-k3s/actions/runs/16695958326/job/47260121295#step:7:1).
</summary>

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.kube-hetzner.data.cloudinit_config.autoscaler_config[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "cloudinit_config" "autoscaler_config" {
      + base64_encode = true
      + boundary      = (known after apply)
      + gzip          = true
      + id            = (known after apply)
      + rendered      = (known after apply)

      + part {
          + content      = (sensitive value)
          + content_type = "text/cloud-config"
          + filename     = "init.cfg"
        }
    }

  # module.kube-hetzner.hcloud_ssh_key.k3s[0] will be created
  + resource "hcloud_ssh_key" "k3s" {
      + fingerprint = (known after apply)
      + id          = (known after apply)
      + labels      = {
          + "cluster"     = "k3s"
          + "engine"      = "k3s"
          + "provisioner" = "terraform"
        }
      + name        = "k3s"
      + public_key  = <<-EOT
            ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAILaiupGNkw2Gzb6AcCtpB9OhYu55hBGF9qIjh6XDKj+Q runner@runner
        EOT
    }

  # module.kube-hetzner.local_file.kustomization_backup[0] will be created
  + resource "local_file" "kustomization_backup" {
      + content              = (sensitive value)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "600"
      + filename             = "k3s_kustomization_backup.yaml"
      + id                   = (known after apply)
    }

  # module.kube-hetzner.null_resource.authentication_config["0-0-control-plane-hel1"] will be created
  + resource "null_resource" "authentication_config" {
      + id       = (known after apply)
      + triggers = {
          + "authentication_config" = "da39a3ee5e6b4b0d3255bfef95601890afd80709"
          + "control_plane_id"      = (known after apply)
        }
    }

  # module.kube-hetzner.null_resource.configure_autoscaler[0] will be created
  + resource "null_resource" "configure_autoscaler" {
      + id       = (known after apply)
      + triggers = {
          + "template" = (known after apply)
        }
    }

  # module.kube-hetzner.null_resource.control_plane_config["0-0-control-plane-hel1"] will be created
  + resource "null_resource" "control_plane_config" {
      + id       = (known after apply)
      + triggers = {
          + "config"           = (sensitive value)
          + "control_plane_id" = (known after apply)
        }
    }

  # module.kube-hetzner.null_resource.control_planes["0-0-control-plane-hel1"] will be created
  + resource "null_resource" "control_planes" {
      + id       = (known after apply)
      + triggers = {
          + "control_plane_id" = (known after apply)
        }
    }

  # module.kube-hetzner.null_resource.first_control_plane will be created
  + resource "null_resource" "first_control_plane" {
      + id = (known after apply)
    }

  # module.kube-hetzner.null_resource.kustomization will be created
  + resource "null_resource" "kustomization" {
      + id       = (known after apply)
      + triggers = {
          + "ccm_use_helm"     = "true"
          + "helm_values_yaml" = (sensitive value)
          + "options"          = <<-EOT
                period=5m
                post-reboot-node-labels=kured=done
                pre-reboot-node-labels=kured=rebooting
                reboot-command=/usr/bin/systemctl reboot
                reboot-sentinel=/sentinel/reboot-required
            EOT
          + "versions"         = <<-EOT
                v1.31
                N/A
                v1.32.0
                N/A
                N/A
                N/A
                N/A
                1.17.0
                N/A
                N/A
                N/A
                *
                *
                *
                *
                v0.14.2
            EOT
        }
    }

  # module.kube-hetzner.ssh_sensitive_resource.kubeconfig will be created
  + resource "ssh_sensitive_resource" "kubeconfig" {
      + agent                              = (sensitive value)
      + bastion_port                       = "22"
      + commands                           = [
          + "cat /etc/rancher/k3s/k3s.yaml",
        ]
      + commands_after_file_changes        = true
      + host                               = (known after apply)
      + id                                 = (known after apply)
      + ignore_no_supported_methods_remain = false
      + port                               = "22"
      + private_key                        = (sensitive value)
      + result                             = (sensitive value)
      + retry_delay                        = "10s"
      + timeout                            = "15m"
      + user                               = "root"
      + when                               = "create"
    }

  # module.kube-hetzner.module.control_planes["0-0-control-plane-hel1"].data.cloudinit_config.config will be read during apply
  # (config refers to values not yet known)
 <= data "cloudinit_config" "config" {
      + base64_encode = true
      + boundary      = (known after apply)
      + gzip          = true
      + id            = (known after apply)
      + rendered      = (known after apply)

      + part {
          + content      = (known after apply)
          + content_type = "text/cloud-config"
          + filename     = "init.cfg"
        }
    }

  # module.kube-hetzner.module.control_planes["0-0-control-plane-hel1"].hcloud_server.server will be created
  + resource "hcloud_server" "server" {
      + allow_deprecated_images    = false
      + backup_window              = (known after apply)
      + backups                    = false
      + datacenter                 = (known after apply)
      + delete_protection          = false
      + firewall_ids               = [
          + 2327265,
        ]
      + id                         = (known after apply)
      + ignore_remote_firewall_ids = false
      + image                      = "306553279"
      + ipv4_address               = (known after apply)
      + ipv6_address               = (known after apply)
      + ipv6_network               = (known after apply)
      + keep_disk                  = false
      + labels                     = {
          + "cluster"     = "k3s"
          + "engine"      = "k3s"
          + "provisioner" = "terraform"
          + "role"        = "control_plane_node"
        }
      + location                   = "hel1"
      + name                       = (known after apply)
      + placement_group_id         = 1088069
      + primary_disk_size          = (known after apply)
      + rebuild_protection         = false
      + server_type                = "cx22"
      + shutdown_before_deletion   = false
      + ssh_keys                   = (known after apply)
      + status                     = (known after apply)
      + user_data                  = (known after apply)

      + network {
          + alias_ips   = []
          + ip          = "10.64.0.101"
          + mac_address = (known after apply)
          + network_id  = 11303413
        }

      + public_net {
          + ipv4         = (known after apply)
          + ipv4_enabled = true
          + ipv6         = (known after apply)
          + ipv6_enabled = true
        }
    }

  # module.kube-hetzner.module.control_planes["0-0-control-plane-hel1"].null_resource.os_upgrade_toggle will be created
  + resource "null_resource" "os_upgrade_toggle" {
      + id       = (known after apply)
      + triggers = {
          + "os_upgrade_state" = "enabled"
          + "server_id"        = (known after apply)
        }
    }

  # module.kube-hetzner.module.control_planes["0-0-control-plane-hel1"].null_resource.registries will be created
  + resource "null_resource" "registries" {
      + id       = (known after apply)
      + triggers = {
          + "registries" = " "
        }
    }

  # module.kube-hetzner.module.control_planes["0-0-control-plane-hel1"].null_resource.zram will be created
  + resource "null_resource" "zram" {
      + id       = (known after apply)
      + triggers = {
          + "zram_size" = null
        }
    }

  # module.kube-hetzner.module.control_planes["0-0-control-plane-hel1"].random_string.identity_file will be created
  + resource "random_string" "identity_file" {
      + id          = (known after apply)
      + length      = 20
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

  # module.kube-hetzner.module.control_planes["0-0-control-plane-hel1"].random_string.server will be created
  + resource "random_string" "server" {
      + id          = (known after apply)
      + keepers     = {
          + "name" = "k3s-control-plane-hel1"
        }
      + length      = 3
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = false
      + numeric     = false
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

Plan: 15 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + kubeconfig = (sensitive value)
```
</details>
<!-- placeholder-5 -->
<!-- terraform-10-d4f15006c8c98d4f78a2c306b3d58885.tfplan -->
<!-- placeholder-6 -->